    
Процедура ОбработкаЗаполнения(ДанныеЗаполнения)		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Договор") Тогда
		// Заполнение шапки
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Валюта = ТекСтрокаТовары.Валюта;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры


     

Процедура ОбработкаПроведения(Отказ, Режим)
	   	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровОстатки.Склады КАК Склады,
		|	ОстаткиТоваровОстатки.КоличествоТоваровОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(
		|			,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					ПродажаТовараТовары.Номенклатура КАК Номенклатура
		|				ИЗ
		|					Документ.ПродажаТовара.Товары КАК ПродажаТовараТовары
		|				ГДЕ
		|					ПродажаТовараТовары.Ссылка = &Ссылка)) КАК ОстаткиТоваровОстатки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатПоТоварам = Запрос.Выполнить().Выгрузить();
	СтрокаСообщения = " ";
	
	Для Каждого Стр Из Товары Цикл
		СтрокаТовара = РезультатПоТоварам.Найти(Стр.Номенклатура,"Номенклатура");
		Если НЕ ЗначениеЗаполнено(СтрокаТовара) Тогда
			СтрокаСообщения = СтрокаСообщения + "Товар " + Стр.Номенклатура + " отсутсвует на складе" + Символы.ПС;
		ИначеЕсли СтрокаТовара.Количество < Стр.Количество Тогда
			СтрокаСообщения = СтрокаСообщения + "Нет товара " + Стр.Номенклатура + " для продажи в количестве" + (Стр.Количество - СтрокаТовара.Количество) + Символы.ПС;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СтрокаСообщения) Тогда
		Сообщить(СтрокаСообщения);
		Отказ = Истина;
	КонецЕсли;
		
		
		// регистр ОстаткиТоваров Расход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склады = Склад;
		Движение.КоличествоТоваров = ТекСтрокаТовары.Количество;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
