
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ДоговорПечать)
	ТабДок = Новый ТабличныйДокумент;
	ДоговорПечать(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ДоговорПечать(ТабДок, ПараметрКоманды)
	Документы.Договор.ДоговорПечать(ТабДок, ПараметрКоманды);
КонецПроцедуры
