&НаКлиенте Процедура ТоварыКоличествоПриИзменении(Элемент)  СтрокаТабличнойЧасти = Элементы.ПоступлениеТоваров.ТекущиеДанные;  СерверныеПроцедуры.АвтоСумма(СтрокаТабличнойЧасти); КонецПроцедуры   &НаКлиенте Процедура ТоварыЦеныПриИзменении(Элемент)  СтрокаТабличнойЧасти = Элементы.ПоступлениеТоваров.ТекущиеДанные;  СерверныеПроцедуры.АвтоСумма(СтрокаТабличнойЧасти); КонецПроцедуры  &НаКлиенте Процедура ТоварыТоварПриИзменении(Элемент)  СтрокаРасчета = Элемент.ПоступлениеТоваров.ТекущиеДанные;  СтрокаРасчета.Цена = ПолучитьЦену(СтрокаРасчета.Товар);  ТоварыТоварПриИзменении(Элемент); КонецПроцедуры        &НаСервере 
Функция ПолучитьЦену(ТоварДокумента) 
 СтруктураОтбора = Новый Структура; 
 СтруктураОтбора.Вставить("Товар" , ТоварДокумента); 
 РезультатОтбора = РегистрыСведений.ЦеныНоменклатуры.Получить(СтруктураОтбора); 
 Возврат РезультатОтбора.Цена; 
КонецФункции